[{"title": "Damian Lillard Confirms Trade Request, 'Would Just Prefer Not to Speak' About Blazers", "author": "Tyler Conway", "link": "https://bleacherreport.com/articles/10087141-damian-lillard-confirms-trade-request-would-just-prefer-not-to-speak-about-blazers", "content": "In his first interview since requesting a trade to the Miami Heat, Portland Trail Blazers guard Damian Lillard isn't saying much.\"I can say that there was [a trade request] and I would just prefer not to speak on the Trail Blazers,\" Lillard told Marc J. Spears of Andscape.The All-Star guard asked for a trade in July and has been adamant about his desire to play for the Heat. While Portland continues to explore the trade market, there has not been much movement in fulfilling Lillard's request.Blazers general manager Joe Cronin told reporters he would be willing to wait \"months\" for the right trade.\"I think what I've learned more than anything is patience is critical,\" Cronin said. \"Don't be reactive. Don't jump at things just to seemingly solve a problem. I think the teams that have ended up in the most positive situations post-trade have been the ones that have been really diligent in taking their time and not been impulsive, or the teams that really kept their urgency under control.\"So I think that's how my approach has been with this and will be with this. We're going to be patient; we're going to do what's best for our team. We're going to see how this lands. And if it takes months, it takes months.\"No details on trade packages offered by Miami have emerged, but it would stand to reason Tyler Herro, Nikola Jovic and 2023 first-round pick Jaime Jaquez Jr. would be included along with multiple future first-round picks.ESPN's Adrian Wojnarowski has reported the Blazers do not have interest in Herro and would want to reroute him to a third team. Herro is heading into the first season of a four-year, $120 million contract, and it's clear Portland does not want any parts of that deal and wants assets it could get in return for Herro.That alone is enough to throw a monkey wrench into trade talks.Lillard acknowledging his trade request could lead to punishment from the NBA given public requests are prohibited in the collective bargaining agreement.", "image": "https://media.bleacherreport.com/image/upload/w_40,h_27,c_fill/v1692888249/wr0flcthoee5lcu7non1.jpg", "date": "August 24, 2023"}, {"title": "Damian Lillard Trade Rumors: Heat-Blazers Talks 'Could Pick Up' as Camp Nears", "author": "Doric Sam", "link": "https://bleacherreport.com/articles/10087078-damian-lillard-trade-rumors-heat-blazers-talks-could-pick-up-as-camp-nears", "content": "It's been nearly two months since Portland Trail Blazers star point guard Damian Lillard requested to be traded to the Miami Heat, and there hasn't been much progress in negotiations between the two teams.However, that reportedly could change soon.Anthony Chiang of the Miami Herald reported this week that the Heat and Blazers are expected to reengage in trade discussions as the start of training camp draws nearer.\"The expectation from those around this situation is that trade talks could pick up as the start of camp inches closer,\" Chiang stated. \"And if the Heat is the only team extending a serious offer for Lillard, then the Trail Blazers may need to at least engage the Heat on some health trade discussions.\"Training camp begins for NBA teams on Tuesday, Oct. 3. It's likely that both the Blazers and Lillard would want this situation resolved before then.The 33-year-old requested to be traded from Portland after 11 seasons at the beginning of July, and it was noted that his preference would be to land in Miami with the reigning Eastern Conference champions.Blazers general manager Joe Cronin made it clear last month that the team is in no rush to complete a deal, telling reporters, \"We're going to be patient. If it takes months, it takes months.\" He added that Portland will ensure that its desires are met in return for trading the seven-time All-Star.\"In any deal, the goal is to come out with the best outcome,\" Cronin said. \"So for us, that can be many different things. It can be more of a win-now player and that would be intriguing to us. It could be a young player and picks, and that would be intriguing. It could be just picks, we would look at that, as well. For us, it's how can we maximize this return and I don't think we have any set parameters.\"It will be interesting to see if Lillard gets his wish and lands in Miami. Acquiring the floor general would make the Heat the favorites to once again represent the Eastern Conference in the NBA Finals.", "image": "https://media.bleacherreport.com/image/upload/w_40,h_27,c_fill/v1692820560/ntaqokrfnc4hlbxe389k.jpg", "date": "August 23, 2023"}, {"title": "Celtics Rumors: TJ Warren, Lamar Stevens to Work Out for Boston amid Free Agency", "author": "Timothy Rapp", "link": "https://bleacherreport.com/articles/10086984-celtics-rumors-tj-warren-lamar-stevens-to-work-out-for-boston-amid-free-agency", "content": "The Boston Celtics have reportedly scheduled meetings with free-agent wings T.J. Warren and Lamar Stevens, according to Shams Charania of The Athletic and Stadium.Celtics meeting with two free agent forwards in Boston this week for a potential wing addition, sources say: <a href=\"https://t.co/zTEWDmy3yI\">pic.twitter.com/zTEWDmy3yI</a>The Celtics have serious depth issues on the wing behind Jaylen Brown and Jayson Tatum, with Peyton Pritchard, Malcolm Brogdon and Sam Hauser the most likely bench players to see minutes at guard and at the 3.The downside of the Kristaps Porziņģis trade for the Celtics was that it cost them a key player at guard in Marcus Smart. Grant Williams left in free agency, costing them another player with defensive and positional versatility.Boston's president of basketball operations, Brad Stevens, told reporters during Summer League that the Celtics would try to bolster the bench.\"I think we'll try to add obviously a little bit,\" he said. \"I'd like to get a little more depth, maybe on the wing, and then also maybe with a 4/3 type. I feel pretty good about our bigs. We've got a couple two ways, so we've got some things we're still very much looking at.\"It's fair to question how much Warren would offer.The 29-year-old missed the entire 2021-22 season and only played in four games during the 2020-21 campaign due to multiple stress fractures in his left foot. He returned last season and appeared in 42 total games between the Brooklyn Nets and Phoenix Suns, averaging just 7.5 points in 16.4 minutes per contest.Prior to his foot issues, Warren was a reliable bucket, averaging a career-high 19.8 points per game in the 2019-20 season while shooting 40.3 percent from three that season.Last year, however, he shot just 32.8 percent from deep, a concern given that Warren was never an elite defensive option on the wing. If he isn't scoring, he loses value, although Boston has enough of a need on the wing to give him a look and hope he can provide an instant dose of scoring off the bench.Stevens, 26, appeared in 62 games (25 starts) for the Cleveland Cavaliers last season, putting up 5.3 points in 18.1 minutes per contest while shooting 31.6 percent from three. He's less of an offensive threat but would give the Celtics another solid, versatile defensive option in the rotation.", "image": "https://media.bleacherreport.com/image/upload/x_0,y_102,w_1800,h_1199,c_crop/w_40,h_27,c_fill/v1692756434/fy6k3tt8a4jymwtrimr0.jpg", "date": "August 23, 2023"}, {"title": "Imagining Journeymen NBA Stars On the Teams That Drafted Them", "author": "Greg Swartz", "link": "https://bleacherreport.com/articles/10086872-imagining-journeymen-nba-stars-on-the-teams-that-drafted-them", "content": "NBA stars coming home or ending their careers with the franchises where they got their start can be a fun, full-circle story. Think Allen Iverson with the Philadelphia 76ers in 2009-10 or Scottie Pippen with the Chicago Bulls in 2003-04.The problem is, these players often come back far too late in their careers for them to still make a significant impact.Instead, though, imagine what it would look like if today's Kevin Durant returned to a young, up-and-coming Oklahoma City Thunder team. How cool would it be for a Paul George reunion with the Indiana Pacers? Think about LeBron James returning to the Cleveland Cavaliers in 2014-15.Let's jump into 2K mode for the next few minutes, exploring what veteran NBA stars would look like today on the team that drafted them, and if a reunion could actually happen…How it StartedGeorge was selected No. 10 overall in 2010, spending seven seasons in Indiana before being traded to the Oklahoma City Thunder in 2017 for Victor Oladipo and Domantas Sabonis.How George and the Pacers Would WorkWhile the trade that sent George to OKC ended up working out well for both teams, getting the now-33-year-old wing back to Indiana would actually make a lot of sense.There are franchise pillars already in place here with All-Star point guard Tyrese Haliburton locked in at point guard for the next six years. Bennedict Mathurin is going into Year 2 after averaging 16.7 points per game as a rookie, and Myles Turner was awarded with a two-year extension and some extra instant cash during a career-best season in 2022-23.Adding a premier wing in George would be a perfect fit, as he's coming off an eighth All-Star season with averages of 23.8 points, 6.1 rebounds, 5.1 assists and 1.5 steals.While Indiana doesn't project to be more than a play-in team this season, adding a star like George to this core would instantly bump them up to being a playoff lock in the East.Could a Reunion Happen?Actually, yes.George only has one guaranteed year left on his contract with the Los Angeles Clippers, although it's hard to imagine he'll not pick up his $48.8 million player option for 2024-25.The Pacers could open up $37 million worth of cap space by declining team options on Bruce Brown, Daniel Theis and Isaiah Jackson alone, and they will have just one player (Haliburton) earning over $20 million.If George concedes that the partnership between him and Kawhi Leonard simply isn't going to work due to availability concerns, a return to Indiana with Haliburton, Turner, Mathurin and others is a really interesting idea.How it StartedButler was selected No. 30 overall in 2011, spending six seasons in Chicago before being traded to the Minnesota Timberwolves in 2017 with Justin Patton for Zach LaVine, Lauri Markkanen and Kris Dunn.How Butler and the Bulls Would WorkFrom averaging 2.6 points per game as a rookie to becoming one of the NBA's best players and a three-time All-Star, Butler had a memorable run in Chicago.For a team that is now stuck in mediocrity, the franchise could use someone like the Houston native for his skill set and passion to pull it out of the mud.With LaVine and DeMar DeRozan, this is a wing-heavy Chicago side that ranked fifth overall in defense last season (112.5 rating). We'd likely see a lot of Butler running point guard for the Bulls, which are still without an answer at the position as they wait for Lonzo Ball's possible return in 2024-25.Butler, who will be 34 in September, wouldn't be a perfect fit on this roster, although building a team full of big, playmaking wings does sound like a recipe for success in today's NBA.Could a Reunion Happen?Unless the Miami Heat fail to trade for Damian Lillard this summer and they stumble back toward the middle of the conference, it's hard to imagine Butler showing any signs of wanting to leave South Florida.He's led the Heat to two NBA Finals appearances in four years, making two All-Star and three All-NBA teams in the process. He is still under contract for the next two seasons with a $52.4 million player option in 2025-26.Chicago can dream, but Butler seems destined to stay in Miami, possibly for the remainder of his career.How it StartedLeonard was selected No. 15 overall in 2011 in a draft-night trade with the Indiana Pacers, spending seven seasons in San Antonio before being traded to the Toronto Raptors in 2018 with Danny Green and cash for DeMar DeRozan, Jakob Poeltl and a 2019 first-round pick.How Leonard and the Spurs Would WorkNow this would be fascinating.Leonard beginning his career playing with one legendary big man in Tim Duncan and ending it with another potential all-time great in Victor Wembanyama would be an unbelievable story.From the outside it appears his relationship with Gregg Popovich is healed enough to work together once again, and the 32-year-old stated this past season that \"we've been in too many battles to have a scar in our relationship.\"Putting Leonard and Wembanyama on the same team gives the Spurs a lockdown defense already, and there's enough other young talent on the roster in Jeremy Sochan, Keldon Johnson, Devin Vassell, Malaki Branham, Tre Jones and others to field a competitive roster in a few years.Could a Reunion Happen?Technically, yes.No NBA team projects to have more cap space in 2024 than the Spurs, a number that could reach $55.3 million according to Spotrac's Keith Smith. That figure is about $7 million higher than Leonard's player option with the Los Angeles Clippers for 2024-25.There's been no real extension talks reported thus far between Leonard and the Clippers, leaving the door open for him to become an unrestricted free agent in 2024.While the Spurs may not want to go all-in on a 32-year-old with a long list of injuries, Popovich is 74 and likely desires to coach a team with a real chance at a championship again. When healthy, Leonard is still one of the best players in the world.Developing Wembanyama this season, signing Leonard as a free agent next summer and trading some of the young talent and collection of future firsts for more veteran help absolutely should be on the table for the Spurs moving forward.How it StartedDurant was selected No. 2 overall in 2007 by the Seattle SuperSonics, spending nine seasons in Seattle/Oklahoma City before leaving to sign with the Golden State Warriors in 2016.How Durant and the Thunder Would WorkThe Thunder already have one of the best young cores in the NBA with Shai Gilgeous-Alexander, Josh Giddey, Jalen Williams, Chet Holmgren and others. Adding Durant to this mix as a veteran forward who finished eighth in the league in scoring with 29.1 points per night would quickly make OKC an unstoppable force in the West.A supersized lineup with Gilgeous-Alexander, Giddey, Williams, Durant and Holmgren would be a juggernaut on offense and hold up defensively as well.While the current Thunder team lacks playoff experience, the 13-time All-Star ranks seventh on the all-time postseason scoring list with 166 total games and two Finals MVP trophies to his name.Durant is exactly what OKC needs to take the next step to becoming a playoff lock in the West.Could a Reunion Happen?Durant won't be a free agent until 2026 and will turn 38 right before the 2026-27 season. While a lot of this Thunder core will be entering their primes around then, he will inevitably take a step back.The best OKC can hope for is that the Durant-Devin Booker-Bradley Beal experiment fails in Phoenix and the Suns eventually put the veteran forward on the trade block. The Thunder still have more future draft picks than any NBA team and could make a huge offer for Durant if he ever becomes available.This would be a tremendous career arc for Durant, especially if he did end his career in Oklahoma City and help win the franchise its first title since 1979.For now, though, the Thunder will have to wait.How it StartedJames was selected No. 1 overall in 2003, spending seven seasons in Cleveland before leaving to sign with the Miami Heat in 2010. He re-signed with the Cavaliers in 2014, spending four more years with the franchise before joining the Los Angeles Lakers as a free agent in 2018.How James and the Cavs Would WorkWho says you can't go home again, again?James has already dedicated 11 years of his playing career to the Cavaliers and won the franchise a title in 2016, although this current core may be the most talented he's ever played with.Donovan Mitchell was an All-Star starter this past season and one of the best shooting guards in the NBA. Darius Garland and Jarrett Allen were both All-Stars in 2022, and Evan Mobley finished third in Defensive Player of the Year voting.There are a lot of role players to like here as well, a group that includes Caris LeVert, Max Strus, Georges Niang and Isaac Okoro.Adding James as the starting small forward would make this the best team in the East, as he's never had this amount of scoring and playmaking around him while with the Cavs.Could a Reunion Happen?James has stated himself that the door isn't closed on a return to Cleveland.The 38-year-old is under contract for one more season with the Lakers before having to make a decision on a $51.4 million player option for 2024-25.He can become an unrestricted free agent next summer, although the Cavs aren't going to have cap space and could only offer a non-taxpayer mid-level exception of around $13 million. That's a lot of money for James to leave on the table, especially from a Lakers team with a revamped roster.James' future could still be tied to Bronny and how his career unfolds after suffering cardiac arrest during a July practice at USC. The 18-year-old would be draft-eligible in 2024 if he can resume his playing career this winter.For now, there are no signs of James leaving the Lakers anytime soon. Cleveland's best chance at a reunion would likely come in 2025 after he has fulfilled the final two years on his contract in L.A.", "image": "https://media.bleacherreport.com/image/upload/x_203,y_45,w_1286,h_858,c_crop/w_40,h_27,c_fill/v1692746533/o9r6kbkjd7dlvdzshwdn.jpg", "date": "August 23, 2023"}, {"title": "Bulls Hope DeMar DeRozan Will Sign Long-Term Contract, GM Marc Eversley Says", "author": "Doric Sam", "link": "https://bleacherreport.com/articles/10086936-bulls-hope-demar-derozan-will-sign-long-term-contract-gm-marc-eversley-says", "content": "As star swingman DeMar DeRozan enters the final year of his contract with the Chicago Bulls, the team has hopes of continuing their partnership well beyond 2024.\"DeMar's been great,\" Bulls general manager Marc Eversley told The Athletic's Darnell Mayberry. \"He's been terrific for this group, not only on the court but off the court. He's been a leader. I would love DeMar to be part of this program long term.\"Eversley went on to add that discussions about a long-term deal with DeRozan have yet to take place, but he's hopeful that the veteran shares the team's interest in remaining together for the foreseeable future.\"Let's see how that plays out and what that looks like going forward. When those conversations take place, we'll speak about that more when that happens,\" Eversley said. \"But we hope Deebo's back. He's been an integral part of this program's success. We hope he is here long term.\"DeRozan joined the Bulls after a sign-and-trade with the San Antonio Spurs prior to the 2021-22 season. He's set to make $28.6 million in the final year of his current deal, per Spotrac.The 34-year-old has been selected to the All-Star Game in each of his last two seasons in Chicago. After averaging a career-high 27.9 points in his first year with the Bulls, that figure dropped to 24.5 ppg last season. However, his efficiency remained intact as he shot 50.4 percent from the field for the second straight year.Despite DeRozan's strong play, the Bulls finished with a 40-42 record and were bounced from the play-in tournament. A better finish in 2023-24 likely will go a long way toward convincing DeRozan to remain with the team beyond the upcoming campaign.", "image": "https://media.bleacherreport.com/image/upload/w_40,h_27,c_fill/v1692731049/fv269rbo6uxuosxbwtko.jpg", "date": "August 22, 2023"}]
